app/Controllers/Client/CompteController.php

    public function index()
    {
        $clientId = session()->get('client')['id'];
        $clientModel = new ClientModel();
        $data['client'] = $clientModel->find($clientId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 4