app/Controllers/Client/LoginController.php

    public function login()
    {
        $telephone = trim($this->request->getPost('numero_telephone'));

        if ($telephone === '') {
            return redirect()->back()->with('error', 'Le numéro de téléphone est obligatoire.');
        }

        $prefixeModel = new PrefixeModel();
        $prefixeValide = $prefixeModel->trouverPourNumero($telephone);

        if (! $prefixeValide) {
            return redirect()->back()->with('error', 'Le préfixe n\'est pas autorisé.');
        }

        $clientModel = new ClientModel();
        $client = $clientModel->where('numero_telephone', $telephone)->first();

        if (! $client) {
            $clientModel->insert(['numero_telephone' => $telephone, 'solde' => 0]);
            $client = $clientModel->where('numero_telephone', $telephone)->first();
---
SELECT *
FROM `clients`
WHERE `numero_telephone` = '0323333333'
 LIMIT 1
INSERT INTO `clients` (`numero_telephone`, `solde`, `created_at`, `updated_at`) VALUES ('0323333333', 0, '2026-07-20 12:51:33', '2026-07-20 12:51:33')