app/Controllers/Client/OperationController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 5
UPDATE `clients` SET `solde` = 500000, `updated_at` = '2026-07-20 12:52:18'
WHERE `clients`.`id` IN (5)
SELECT *
FROM `type_transaction`
WHERE `code` = 'depot'
 LIMIT 1
INSERT INTO `transactions` (`client_id`, `client_destinataire_id`, `type_transaction_id`, `montant`, `frais`, `nouveau_solde`, `created_at`, `updated_at`) VALUES (5, NULL, 1, 500000, 0, 500000, '2026-07-20 12:52:18', '2026-07-20 12:52:18')
---
    public function depot()
    {
        $clientId = session()->get('client')['id'];
        $montant = (int) $this->request->getPost('montant');

        if ($montant <= 0) {
            return redirect()->back()->with('error', 'Le montant doit être supérieur à 0.');
        }

        $clientModel = new ClientModel();
        $client = $clientModel->find($clientId);
        $nouveauSolde = $client['solde'] + $montant;

        $clientModel->update($clientId, ['solde' => $nouveauSolde]);

        $transactionModel = new TransactionModel();
        $typeModel = new TypeTransactionModel();
        $type = $typeModel->where('code', 'depot')->first();

        $transactionModel->insert([
            'client_id' => $clientId,
            'client_destinataire_id' => null,
            'type_transaction_id' => $type['id'],
            'montant' => $montant,
            'frais' => 0,
            'nouveau_solde' => $nouveauSolde,
        ]);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 2
SELECT *
FROM `type_transaction`
WHERE `code` = 'transfert'
 LIMIT 1
---
    public function transfert()
    {
        $emetteurId = session()->get('client')['id'];
        $destinataireTelephone = trim($this->request->getPost('numero_destinataire'));
        $montant = (int) $this->request->getPost('montant');
        $inclureFraisRetrait = (bool) $this->request->getPost('inclure_frais_retrait');

        if ($montant <= 0) {
            return redirect()->back()->with('error', 'Le montant doit être supérieur à 0.');
        }

        $clientModel = new ClientModel();
        $emetteur = $clientModel->find($emetteurId);
        $prefixeModel = new PrefixeModel();
        $prefixe = $prefixeModel->trouverPourNumero($destinataireTelephone);

        if ($prefixe === null) {
            return redirect()->back()->with('error', 'Numéro non pris en charge.');
        }

        $typeModel = new TypeTransactionModel();
        $typeTransfert = $typeModel->where('code', 'transfert')->first();

SELECT *
FROM `clients`
WHERE `clients`.`id` = 5
SELECT *
FROM `type_transaction`
WHERE `code` = 'transfert'
 LIMIT 1
SELECT *
FROM `type_transaction`
WHERE `code` = 'retrait'
 LIMIT 1
---
        }

        $clientModel = new ClientModel();
        $emetteur = $clientModel->find($emetteurId);
        $prefixeModel = new PrefixeModel();
        $typeModel = new TypeTransactionModel();
        $typeTransfert = $typeModel->where('code', 'transfert')->first();
        $typeRetrait = $typeModel->where('code', 'retrait')->first();

SELECT *
FROM `clients`
WHERE `numero_telephone` = '0345555555'
 LIMIT 1
---
            }

            if (empty($prefixe['operateur_externe_id'])) {
                $destinataire = $clientModel->where('numero_telephone', $part['numero'])->first();

UPDATE `clients` SET `solde` = 479700, `updated_at` = '2026-07-20 12:52:41'
WHERE `clients`.`id` IN (5)
---

        try {
            $nouveauSoldeEmetteur = $emetteur['solde'] - $totalCost;
            $clientModel->update($emetteurId, ['solde' => $nouveauSoldeEmetteur]);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 3
UPDATE `clients` SET `solde` = 110000, `credit_frais_retrait` = 0, `updated_at` = '2026-07-20 12:52:41'
WHERE `clients`.`id` IN (3)
INSERT INTO `transactions` (`client_id`, `client_destinataire_id`, `type_transaction_id`, `montant`, `frais`, `nouveau_solde`, `frais_retrait_inclus`, `groupe_envoi`, `created_at`, `updated_at`) VALUES (5, 3, 3, 10000, 100, 479700, 0, '0dffe919fc4e9177', '2026-07-20 12:52:41', '2026-07-20 12:52:41')
INSERT INTO `transactions` (`client_id`, `client_destinataire_id`, `type_transaction_id`, `montant`, `frais`, `nouveau_solde`, `groupe_envoi`, `created_at`, `updated_at`) VALUES (3, 5, 3, 10000, 0, 110000, '0dffe919fc4e9177', '2026-07-20 12:52:41', '2026-07-20 12:52:41')
INSERT INTO `transactions` (`client_id`, `client_destinataire_id`, `type_transaction_id`, `montant`, `frais`, `nouveau_solde`, `operateur_externe_id`, `numero_destinataire_externe`, `commission`, `frais_retrait_inclus`, `groupe_envoi`, `created_at`, `updated_at`) VALUES (5, NULL, 3, 10000, 100, 479700, 1, '0323333333', 100, 0, '0dffe919fc4e9177', '2026-07-20 12:52:41', '2026-07-20 12:52:41')
---

            foreach ($operations as $operation) {
                if ($operation['type'] === 'interne') {
                    $destinataireActuel = $clientModel->find($operation['destinataire']['id']);
                    $nouveauSoldeDestinataire = $destinataireActuel['solde'] + $operation['montant'];
                    $nouveauCreditFraisRetrait = $destinataireActuel['credit_frais_retrait'] + $operation['frais_retrait_estime'];

                    $clientModel->update($operation['destinataire']['id'], [
                        'solde' => $nouveauSoldeDestinataire,
                        'credit_frais_retrait' => $nouveauCreditFraisRetrait,
                    ]);

                    $transactionModel->insert([
                        'client_id' => $emetteurId,
                        'client_destinataire_id' => $operation['destinataire']['id'],
                        'type_transaction_id' => $typeTransfert['id'],
                        'montant' => $operation['montant'],
                        'frais' => $operation['frais_bareme'],
                        'nouveau_solde' => $nouveauSoldeEmetteur,
                        'frais_retrait_inclus' => $operation['frais_retrait_inclus'],
                        'groupe_envoi' => $groupeEnvoi,
                    ]);

                    $transactionModel->insert([
                        'client_id' => $operation['destinataire']['id'],
                        'client_destinataire_id' => $emetteurId,
                        'type_transaction_id' => $typeTransfert['id'],
                        'montant' => $operation['montant'],
                        'frais' => 0,
                        'nouveau_solde' => $nouveauSoldeDestinataire,
                        'groupe_envoi' => $groupeEnvoi,
                    ]);
                    continue;
                }

                $transactionModel->insert([
                    'client_id' => $emetteurId,
                    'client_destinataire_id' => null,
                    'type_transaction_id' => $typeTransfert['id'],
                    'montant' => $operation['montant'],
                    'frais' => $operation['frais_bareme'],
                    'nouveau_solde' => $nouveauSoldeEmetteur,
                    'operateur_externe_id' => $operation['operateur']['id'],
                    'numero_destinataire_externe' => $operation['numero'],
                    'commission' => $operation['commission'],
                    'frais_retrait_inclus' => 0,
                    'groupe_envoi' => $groupeEnvoi,
                ]);

SELECT `transactions`.*, `type_transaction`.`libelle` AS `type_transaction_libelle`, `type_transaction`.`code` AS `type_transaction_code`, `operateurs_externes`.`nom` AS `operateur_externe_nom`, `clients_destinataire`.`numero_telephone` AS `client_destinataire_numero`
FROM `transactions`
JOIN `type_transaction` ON `type_transaction`.`id` = `transactions`.`type_transaction_id`
LEFT JOIN `operateurs_externes` ON `operateurs_externes`.`id` = `transactions`.`operateur_externe_id`
LEFT JOIN `clients` `clients_destinataire` ON `clients_destinataire`.`id` = `transactions`.`client_destinataire_id`
WHERE `transactions`.`client_id` = 5
ORDER BY `transactions`.`created_at` DESC
---
    public function historique()
    {
        $clientId = session()->get('client')['id'];
        $transactionModel = new TransactionModel();
        $data['transactions'] = $transactionModel
            ->select('transactions.*, type_transaction.libelle AS type_transaction_libelle, type_transaction.code AS type_transaction_code, operateurs_externes.nom AS operateur_externe_nom, clients_destinataire.numero_telephone AS client_destinataire_numero')
            ->join('type_transaction', 'type_transaction.id = transactions.type_transaction_id')
            ->join('operateurs_externes', 'operateurs_externes.id = transactions.operateur_externe_id', 'left')
            ->join('clients clients_destinataire', 'clients_destinataire.id = transactions.client_destinataire_id', 'left')
            ->where('transactions.client_id', $clientId)
            ->orderBy('transactions.created_at', 'DESC')
            ->findAll();