app/Controllers/Client/OperationController.php

SELECT *
FROM `clients`
WHERE `numero_telephone` = '0344354615'
 LIMIT 1
---
    public function transfert()
    {
        $emetteurId = session()->get('client')['id'];
        $destinataireTelephone = trim($this->request->getPost('numero_destinataire'));
        $montant = (int) $this->request->getPost('montant');

        if ($montant <= 0) {
            return redirect()->back()->with('error', 'Le montant doit être supérieur à 0.');
        }

        $clientModel = new ClientModel();
        $emetteur = $clientModel->find($emetteurId);
        $destinataire = $clientModel->where('numero_telephone', $destinataireTelephone)->first();

UPDATE `clients` SET `solde` = 39900, `updated_at` = '2026-07-20 08:21:53'
WHERE `clients`.`id` IN (2)
UPDATE `clients` SET `solde` = 10000, `updated_at` = '2026-07-20 08:21:53'
WHERE `clients`.`id` IN (3)
INSERT INTO `transactions` (`client_id`, `client_destinataire_id`, `type_transaction_id`, `montant`, `frais`, `nouveau_solde`, `created_at`, `updated_at`) VALUES (2, 3, 3, 10000, 100, 39900, '2026-07-20 08:21:53', '2026-07-20 08:21:53')
INSERT INTO `transactions` (`client_id`, `client_destinataire_id`, `type_transaction_id`, `montant`, `frais`, `nouveau_solde`, `created_at`, `updated_at`) VALUES (3, 2, 3, 10000, 0, 10000, '2026-07-20 08:21:53', '2026-07-20 08:21:53')
---
        $nouveauSoldeEmetteur = $emetteur['solde'] - $montant - $frais;
        $nouveauSoldeDestinataire = $destinataire['solde'] + $montant;

        $clientModel->update($emetteurId, ['solde' => $nouveauSoldeEmetteur]);
        $clientModel->update($destinataire['id'], ['solde' => $nouveauSoldeDestinataire]);

        $transactionModel = new TransactionModel();
        $transactionModel->insert([
            'client_id' => $emetteurId,
            'client_destinataire_id' => $destinataire['id'],
            'type_transaction_id' => $type['id'],
            'montant' => $montant,
            'frais' => $frais,
            'nouveau_solde' => $nouveauSoldeEmetteur,
        ]);

        $transactionModel->insert([
            'client_id' => $destinataire['id'],
            'client_destinataire_id' => $emetteurId,
            'type_transaction_id' => $type['id'],
            'montant' => $montant,
            'frais' => 0,
            'nouveau_solde' => $nouveauSoldeDestinataire,
        ]);

SELECT `transactions`.*, `type_transaction`.`libelle` AS `type_transaction_libelle`, `type_transaction`.`code` AS `type_transaction_code`
FROM `transactions`
JOIN `type_transaction` ON `type_transaction`.`id` = `transactions`.`type_transaction_id`
WHERE `transactions`.`client_id` = 2
ORDER BY `transactions`.`created_at` DESC
---
    public function historique()
    {
        $clientId = session()->get('client')['id'];
        $transactionModel = new TransactionModel();
        $data['transactions'] = $transactionModel
            ->select('transactions.*, type_transaction.libelle AS type_transaction_libelle, type_transaction.code AS type_transaction_code')
            ->join('type_transaction', 'type_transaction.id = transactions.type_transaction_id')
            ->where('transactions.client_id', $clientId)
            ->orderBy('transactions.created_at', 'DESC')
            ->findAll();