app/Controllers/Admin/AuthController.php

SELECT *
FROM `admins`
WHERE `email` = 'admin@mobilemoney.mg'
 LIMIT 1
---
    public function login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $model = new AdminModel();
        $admin = $model->where('email', $email)->first();