app/Controllers/Admin/BaremeController.php

SELECT *
FROM `type_transaction`
---
    public function index()
    {
        $baremeModel = new BaremeFraisModel();
        $typeModel = new TypeTransactionModel();

        $data['baremes'] = $baremeModel->orderBy('type_transaction_id', 'ASC')->orderBy('montant_min', 'ASC')->findAll();
        $data['types'] = $typeModel->findAll();