app/Controllers/Admin/PrefixeController.php

SELECT `prefixes`.*, `operateurs_externes`.`nom` AS `operateur_externe_nom`
FROM `prefixes`
LEFT JOIN `operateurs_externes` ON `operateurs_externes`.`id` = `prefixes`.`operateur_externe_id`
ORDER BY `prefixes`.`prefixe` ASC
SELECT *
FROM `operateurs_externes`
ORDER BY `nom` ASC
---
    public function index()
    {
        $model = new PrefixeModel();
        $data['prefixes'] = $model
            ->select('prefixes.*, operateurs_externes.nom AS operateur_externe_nom')
            ->join('operateurs_externes', 'operateurs_externes.id = prefixes.operateur_externe_id', 'left')
            ->orderBy('prefixes.prefixe', 'ASC')
            ->findAll();

        $operatorModel = new OperateurExterneModel();
        $data['operateurs'] = $operatorModel->orderBy('nom', 'ASC')->findAll();