app/Models/PrefixeModel.php

SELECT *
FROM `prefixes`
WHERE `prefixe` = '034'
AND `actif` = 1
 LIMIT 1
---
    public function trouverPourNumero(string $numeroTelephone)
    {
        $prefixe = substr($numeroTelephone, 0, 3);

        return $this->where('prefixe', $prefixe)
            ->where('actif', 1)
            ->first();